[
    {
        "id": 1,
        "image": "./Sub_Images/Kraken.jpeg",
        "title": "Kraken",
        "operating_years": "2021-Present",
        "length": "TBD",
        "beam": "TBD",
        "crew_size": "Single Pilot, (4) Support Divers",
        "propulsion_class": "Single Propeller, Driveshaft",
        "entered_in": "ISR 17, June 2023",
        "awards": "N/A",
        "top_speed": "1.8 Knots",
        "faculty_advisor": "Dr. Christine M. Ikeda",
        "description": "Research and early design concepts for Kraken started in the fall of 2021, with physical work and prototyping starting later that same season. The submarine was engineered with a primary focus on speed, drawing upon lessons learned from previous submarines and teams to enhance system efficiencies, streamline the design, and build process. By the fall of 2022, construction and system integration were complete, leading to an intensive testing phase where submarine systems were further refined and redesigned as necessary in preparation for competition. At the 17th International Submarine Races (ISR 17), there were high expectations for Kraken to not only complete the course but do so with remarkable speed — expectations that were met with success. Despite facing challenges during the competition, Kraken managed to cross the finish line, securing 5th place overall and 3rd in its category. Following its impressive performance at ISR 17, Kraken has taken on a new role: serving as an educational tool for new team members and as a testbed for the development of new systems. "
    },
    {
        "id": 2,
        "image": "./Sub_Images/Nautilus.png",
        "title": "Nautilus",
        "operating_years": "2019-2023",
        "length": "~9ft 4in",
        "beam": "~1ft 8in",
        "crew_size": "Single Pilot, (2) Support Divers",
        "propulsion_class": "Single Propeller, Chain Drive",
        "entered_in": "vISR 16, June 2021, ISR 17, June 2023",
        "awards": "vISR 16: First for Thrust Production Repor, Second for Controls and Maneuverability Report, Second for Operational Problem Solving Challenge",
        "top_speed": "0.6 Knots",
        "faculty_advisor": "Dr. Christine M. Ikeda",
        "description": "The journey of Nautilus began in the spring of 2019 with initial research and early design concepts. Physical work and prototyping commenced towards the end of fall 2019. However, the progress in constructing and testing Nautilus faced significant challenges throughout 2020 due to the COVID-19 pandemic. Despite these setbacks, the team managed to nearly complete the design and planning phases through online collaboration. In the spring of 2021, the team dedicated their efforts to physically building Nautilus and its various internal systems. Nautilus's first competition was at the 16th International Submarine Races (ISR), which, owing to ongoing COVID-19 concerns, was held in June 2021. The virtual ISR 16 (vISR 16) deviated from the traditional in-person drag-race format, emphasizing design reports and a virtual problem-solving challenge instead. The team's submissions for vISR 16 were based on Nautilus's systems, leading to several award wins. Continuing their work on Nautilus, the team prepared for ISR 17 in 2023, where they successfully raced the submarine in person. At ISR 17, Nautilus completed its runs and crossed the finish line." 
    },
    {
        "id": 3,
        "image": "./Sub_Images/Trident.jpg",
        "title": "Trident",
        "operating_years": "2017-2021",
        "length": "~9ft 4in",
        "beam": "~2ft 0in",
        "crew_size": "Single Pilot, (2) Support Divers",
        "propulsion_class": "Single Propeller, Rotational Drive-Train",
        "entered_in": "ISR 15, June 2019",
        "awards": "Second Honorable Mention for Innovation",
        "top_speed": "3.29 Knots",
        "faculty_advisor": "Dr. Christine M. Ikeda",
        "description": "Trident, a pivotal invention for the Human Powered Submarine (HPS) team at Virginia Tech, marked a departure from the traditional \"Phantom\" naming convention and initiated a new tradition in naming their submarines. Constructed using the stripped hull of Phantom 7, every component within Trident was meticulously designed and built from the ground up. Diverging from the recent trend of linear-drive systems used in the Phantom class submarines, Trident reverted to a standard rotational drive system. Learning from the challenges faced with Phantom 8, Trident incorporated hydraulic controls, and a single rotating propeller. These innovations were all part of a strategic plan to create a top-performing submarine at ISR 15 — a goal that was successfully achieved. Today, parts of Trident are retained by the HPS team in the lab."
    },
    {
        "id": 4,
        "image": "./Sub_Images/Phantom8.jpg",
        "title": "Phantom 8",
        "operating_years": "2015-2019",
        "length": "~10ft 0in",
        "beam": "~2ft 0in",
        "crew_size": "Single Pilot, (2) Support Divers",
        "propulsion_class": "Counter-Rotating Prop, Linear Drive-Train",
        "entered_in": "ISR 14 & 15, June 2017 and June 2019",
        "awards": "N/A",
        "top_speed": "1.09 Knots",
        "faculty_advisor": "Dr. Wayne L. Neu and Dr. Christine M. Ikeda",
        "description": "Phantom 8, the final submarine in the Phantom class, was designed to build upon and advance the developments made with Phantom 7. Key innovations included the integration of a linear gearbox and the addition of a counter-rotating propeller system. Additionally, the sophisticated electronics developed for Phantom 6 and Phantom 7 were intended to be the core of an autonomous control system for Phantom 8. Unfortunately, mechanical issues and failures in various systems hindered its performance at the 14th International Submarine Races (ISR). These mechanical challenges persisted throughout its service life. Despite these setbacks, Phantom 8 managed to cross the finish line during ISR 15, marking the end of its active service. Now decommissioned, Phantom 8 is displayed in the showroom window of the Ware Lab."
    },
    {
        "id": 5,
        "image": "./Sub_Images/Phantom7.jpg",
        "title": "Phantom 7",
        "operating_years": "2014-2015",
        "length": "9ft 4in",
        "beam": "2ft 0in",
        "crew_size": "Single Pilot, (2) Support Divers",
        "propulsion_class": "Single Propeller, Linear Drive-Train",
        "entered_in": "ISR 13",
        "awards": "N/A",
        "top_speed": "N/A",
        "faculty_advisor": "Dr. Wayne L. Neu",
        "description": "Constructed in a record time of five and a half months, Phantom 7 marked a significant milestone in the team's manufacturing capabilities. For the first time, the entire mold was created on campus, signaling a shift towards greater self-reliance in part manufacturing and reducing lead times. However, due to unforeseen challenges and time constraints, Phantom 7 was unable to complete a run at the 13th International Submarine Races (ISR). The hull of Phantom 7, noted for being the most visually striking submarine in the Phantom class, has been stripped of its original components. This hull now serves as the foundation for the team’s next ambitious project, Trident."
    },
    {
        "id": 6,
        "image": "./Sub_Images/Phantom6.jpg",
        "title": "Phantom 6",
        "operating_years": "2007-2015",
        "length": "11ft 2in",
        "beam": "3ft 4in",
        "crew_size": "Two Pilots, (3) Support Divers",
        "propulsion_class": "Dual Linear Drive-Train, Counter-Rotating Twin Propellers",
        "entered_in": "ISR 12, ISR 13",
        "awards": "Innovation Award at ISR 12, 3rd for Speed in Class at ISR 13",
        "top_speed": "1.670 Knots",
        "faculty_advisor": "Dr. Wayne L. Neu",
        "description": "Phantom 6, one of the team's most innovative designs, spent a significant portion of its construction phase as merely an empty shell. The introduction of new regulations in the ISR (International Submarine Races) handbook in 2013 spurred the team into an intensive effort to complete its internal components. The submarine was equipped with an onboard electronic data acquisition system capable of recording speed, propeller RPM, and orientation. This system, in conjunction with its unique side-by-side gearbox design, helped Phantom 6 secure the 1st place award for innovation. The power transmission system underwent a substantial overhaul during its design year, and thanks to an impressive display of 'field engineering' at the competition, Phantom 6 successfully crossed the finish line at the 13th ISR. Although Phantom 6 has been dismantled, various parts are preserved in the Human Powered Submarine (HPS) bay."
    },
    {
        "id": 7,
        "image": "./Sub_Images/Phantom5.jpg",
        "title": "Phantom 5",
        "operating_years": "2003-2011",
        "length": "9ft 1in",
        "beam": "1ft 8in",
        "crew_size": "Single Pilot, (3) Support Divers",
        "propulsion_class": "Single Propeller, Linear Drive-Train",
        "entered_in": "ISR 8, ISR 9, ISR 10, ISR 11",
        "awards": "3rd in Innovation at the 10th ISR",
        "top_speed": "3.771 Knots",
        "faculty_advisor": "Dr. Wayne L. Neu",
        "description": "Phantom 5, participating in four different International Submarine Races (ISR), holds the record as the longest-serving submarine in the history of Virginia Tech's team. Despite an initial setback at the 8th ISR, where Phantom 5 was unable to complete a run, the team made significant improvements to the submarine. These enhancements paid off at the 9th ISR, where Phantom 5 achieved a 5th place finish with a top speed of 3.771 knots. Building on this success, further modifications were made to the submarine, leading to a 3rd place win in the innovation category at the 10th ISR. Phantom 5 concluded its remarkable eight-year service with a final appearance at the 11th ISR."
    },
    {
        "id": 8,
        "image": "./Sub_Images/Specter1.jpg",
        "title": "Specter 1",
        "operating_years": "2001-2003",
        "length": "8ft 6in",
        "beam": "2ft 2in",
        "crew_size": "Single Pilot",
        "propulsion_class": "Non-Propeller, Monofin",
        "entered_in": "ISR 7",
        "awards": "1st for Speed in Class",
        "top_speed": "3.520 Knots",
        "faculty_advisor": "Dr. Wayne L. Neu",
        "description": "Continuing with the tradition of ominous names and introducing a new class, Specter stands out as the only non-propeller driven submarine built by Virginia Tech. It features a unique design with a flooded nose cone, housing both the air supply and the pilot's head. The pilot is equipped with a neoprene skirt extending from the shoulders down to the ankles, where it connects to a single, mermaid-like monofin. Employing a dolphin kick, the pilot can achieve surprising speeds. It is rumored that this concept was considered for various special ops and rescue diving applications. This innovative, fish-like vessel is currently stored in the Human Powered Submarine (HPS) Bay at Virginia Tech’s Ware Lab."
    },
    {
        "id": 9,
        "image": "./Sub_Images/Phantom4.png",
        "title": "Phantom 4",
        "operating_years": "2001-2003",
        "length": "8ft 8in",
        "beam": "1ft 10in",
        "crew_size": "Single Pilot",
        "propulsion_class": "Single Propeller, Bicycle Drive-Train",
        "entered_in": "ISR 7",
        "awards": "3rd for Speed in Class",
        "top_speed": "4.516 Knots",
        "faculty_advisor": "Dr. Wayne L. Neu",
        "description": "Phantom 4, distinguished by its integrated stabilizers and uniquely lightweight hull construction, represented a significant turning point in Virginia Tech's submarine design process. This shift towards a focus on innovation proved to be a successful strategy in subsequent years and designs. Currently, Phantom 4 is prominently displayed in the atrium of Hancock Hall on Virginia Tech's campus, serving as a testament to the team's ingenuity and progress."
    },
    {
        "id": 10,
        "image": "./Sub_Images/Phantom3.jpg",
        "title": "Phantom 3",
        "operating_years": "1999-2001",
        "length": "N/A",
        "beam": "N/A",
        "crew_size": "Single Pilot",
        "propulsion_class": "Single Propeller, Bicycle Drive-Train",
        "entered_in": "ISR 6",
        "awards": "Best Overall Performance",
        "top_speed": "5.017 Knots",
        "faculty_advisor": "Dr. Wayne L. Neu",
        "description": "Phantom 3 is considered the most successful submarine in Virginia Tech’s history. It received the Overall Performance Award at the 6th International Submarine Races (ISR). This prestigious recognition was awarded due to its exceptional speed and maneuverability, the advanced design incorporating composite materials, the sophisticated computerized system for power-to-propulsion conversion, and the team's adaptability to challenging and evolving circumstances during race week. Ultimately, Phantom 3 was donated to the Foundation for Underwater Research and Education, where it serves as a traveling exhibit for outreach events, inspiring future generations of engineers and underwater researchers."
    },
    {
        "id": 11,
        "image": "./Sub_Images/Phantom2.jpg",
        "title": "Phantom 2",
        "operating_years": "1995-1998",
        "length": "N/A",
        "beam": "N/A",
        "crew_size": "Two Pilots",
        "propulsion_class": "Single Propeller, Linear Drive System",
        "entered_in": "ISR 4",
        "awards": "3rd in the two-person Sub category",
        "top_speed": "N/A",
        "faculty_advisor": "Dr. Wayne L. Neu",
        "description": "Powered by a two-person linear drive system, Phantom 2 represented a refined design of its predecessor, suitable for both open-water races and competitions at the Carderock Model Basin. Its construction began in 1995 but was halted shortly after due to the absence of a team in 1996. The project was revived in 1997 when the team reformed, leading to the completion of Phantom 2. During the 1997 competition at NSWC Carderock, Phantom 2 experienced an unrecoverable variable ballast failure, resulting in no score being recorded that year. In the 1998 open-water competition off the California coast, Phantom 2, with most systems completely redesigned, achieved 3rd place in the two-man submarine category. This marked the HPS Team's first-ever score and placement. Although Phantom 2 has since been decommissioned, many parts of its hull and control systems are preserved in the lab, commemorating the submarine's achievements."
    },
    {
        "id": 12,
        "image": "./Sub_Images/Phantom1.jpg",
        "title": "Phantom 1",
        "operating_years": "1991-1993",
        "length": "N/A",
        "beam": "N/A",
        "crew_size": "Two Pilots",
        "propulsion_class": "Single Propeller, Bicycle Drive-Train",
        "entered_in": "ISR 3",
        "awards": "N/A",
        "top_speed": "N/A",
        "faculty_advisor": "Dr. Danny Reed",
        "description": "The first-ever submarine produced by Virginia Tech, Phantom 1, was designed and constructed by dedicated students beginning in 1991. The submarine participated in an open-water competition off the Florida coast in 1993. Although it did not complete a run, Phantom 1 featured notably large control surfaces, each exceeding two square feet in area. After the 1993 competition, the Human Powered Submarine team at Virginia Tech did not compete again until 1998. During this hiatus, Phantom 1 was decommissioned and subsequently dismantled in 1997 to create space in the team's lab for future projects."
    }
]